cask_args appdir: '/Applications'

tap 'homebrew/bundle'

# Needed for PHP
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'homebrew/php'

brew 'ansible'
brew 'ack'
brew 'colordiff'
brew 'coreutils'
brew 'git'
#brew 'grc' # -- Removed because of issues with grc 1.10
brew 'gnu-time'
brew 'node'
brew 'openssl'
brew 'python'
brew 'reattach-to-user-namespace', args: ['with-wrap-pbcopy-and-pbpaste']
brew 'speedtest-cli'
brew 'tmux'
brew 'vim'
brew 'wget'

# PHP
brew 'php56'
brew 'php56-mongodb'

# Note: do we also need readline?

# Image diffs in git
brew 'imagemagick'
brew 'jp2a'
brew 'spaceman-diff'

cask 'atom'
cask 'google-chrome'
cask 'iterm2'
cask 'mou'
cask 'slack'
cask 'sublime-text'
cask 'virtualbox'
cask 'vagrant'
cask 'vagrant-manager'
