cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

brew 'ansible'
brew 'ack'
brew 'colordiff'
brew 'coreutils'
brew 'git'
#brew 'grc' # -- Removed because of issues with grc 1.10
#brew 'gnu-time' # -- Removed because of install issues
#brew 'node' -- Removed in favor of nvm
brew 'openssl'
brew 'python'
brew 'reattach-to-user-namespace', args: ['with-wrap-pbcopy-and-pbpaste']
brew 'speedtest-cli'
brew 'tmux'
brew 'vim'
brew 'wget'
brew 'composer'

# PHP
brew 'php71', link: true

# Note: do we also need readline?

# Image diffs in git
brew 'imagemagick'
brew 'jp2a'
brew 'spaceman-diff'

cask 'atom'
cask 'google-chrome'
cask 'iterm2'
#cask 'mou' # -- Removed because of macOS incompatibility
cask 'slack'
cask 'sublime-text'
cask 'virtualbox'
cask 'vagrant'
cask 'vagrant-manager'
